Repository: winx402/blocks-mac
Catalog: apps/Blocks/BlocksApp/Features/Translation/Resources/TranslationLocalizable.xcstrings
Source language: en
Languages: ja, zh_hans

# translation.dictionary.detail
source: Dictionary downloads, enabled sources, and source ordering are managed by the system Dictionary app.
ja: 辞書のダウンロード、有効なソース、並び順はシステムの「辞書」App で管理します。
zh_hans: 词典下载、启用来源和来源排序由系统“词典”App 管理。

# translation.dictionary.open
source: Open Dictionary
ja: 「辞書」を開く
zh_hans: 打开系统词典

# translation.dictionary.title
source: System dictionaries
ja: システム辞書
zh_hans: 系统词典

# translation.language.automaticTarget
source: Smart target
ja: スマートな翻訳先
zh_hans: 智能目标语言

# translation.language.common
source: Common Languages
ja: よく使う言語
zh_hans: 常用语言

# translation.language.all
source: All Languages
ja: すべての言語
zh_hans: 全部语言

# translation.language.focus
source: Languages of interest
ja: 注目する言語
zh_hans: 关注语言

# translation.language.focus.add
source: Add language
ja: 言語を追加
zh_hans: 添加语言

# translation.language.focus.detail
source: When the source is your native language, Blocks translates to the most recently used language in this ordered list.
ja: 原文が母語の場合、この並び順の中で直近に使用した言語へ翻訳します。
zh_hans: 原文为母语时，优先翻译为此有序列表中最近使用的语言。

# translation.language.focus.moveDown
source: Move down
ja: 下へ移動
zh_hans: 下移

# translation.language.focus.moveUp
source: Move up
ja: 上へ移動
zh_hans: 上移

# translation.language.focus.primary
source: Primary fallback when language detection is uncertain.
ja: 言語検出が不確かな場合の最優先候補です。
zh_hans: 语言检测不可靠时的首选目标。

# translation.language.focus.remove
source: Remove language
ja: 言語を削除
zh_hans: 移除语言

# translation.language.native
source: Native language
ja: 母語
zh_hans: 母语

# translation.language.native.detail
source: Text in other languages is translated into your native language.
ja: 母語以外のテキストは母語へ翻訳します。
zh_hans: 检测到非母语内容时，翻译为母语。

# translation.language.noFocusConfigured
source: Add at least one language of interest before using smart target detection.
ja: スマートな翻訳先を使用するには、注目する言語を1つ以上追加してください。
zh_hans: 请先添加至少一种关注语言，再使用智能目标语言。

# translation.languagePack.awaitingConfirmation
source: Waiting for system confirmation
ja: システムの確認待ち
zh_hans: 等待系统确认

# translation.languagePack.checking
source: Checking
ja: 確認中
zh_hans: 正在检查

# translation.languagePack.download
source: Prepare
ja: 準備
zh_hans: 准备语言包

# translation.languagePack.downloadable
source: Available to download
ja: ダウンロード可能
zh_hans: 可下载

# translation.languagePack.failed
source: Preparation failed
ja: 準備に失敗
zh_hans: 准备失败

# translation.languagePack.installed
source: Installed
ja: インストール済み
zh_hans: 已安装

# translation.languagePack.installing
source: Installing…
ja: インストール中…
zh_hans: 正在安装…

# translation.languagePack.unsupported
source: Not supported
ja: 未対応
zh_hans: 不支持

# translation.languagePack.verificationFailed
source: The system finished preparing the language pair, but it is not ready yet.
ja: システムによる準備は完了しましたが、言語ペアはまだ利用できません。
zh_hans: 系统已完成准备，但该语言对尚未就绪。

# translation.languagePack.verifying
source: Verifying…
ja: 確認中…
zh_hans: 正在验证…

# translation.languageResources.empty
source: No language pairs
ja: 言語ペアがありません
zh_hans: 暂无语言对

# translation.languageResources.empty.detail
source: Add a language of interest to inspect Apple offline translation availability.
ja: Apple オフライン翻訳の状態を確認するには、注目する言語を追加してください。
zh_hans: 添加关注语言后可检查 Apple 离线翻译可用状态。

# translation.languageResources.system.detail
source: The operating system owns installed translation language data. Blocks shows availability but no fabricated download percentage.
ja: 翻訳言語データはシステムが管理します。Blocks は利用状況を表示しますが、架空のダウンロード率は表示しません。
zh_hans: 翻译语言数据由系统管理；积木工具展示可用状态，但不提供虚假下载百分比。

# translation.languageResources.system.open
source: Open Language Settings
ja: 言語設定を開く
zh_hans: 管理系统翻译语言

# translation.languageResources.system.title
source: System translation languages
ja: システム翻訳言語
zh_hans: 系统翻译语言

# translation.languageResources.title
source: Languages and dictionaries
ja: 言語と辞書
zh_hans: 语言与词典

# menu.translationFavorites
source: Translation Favorites
ja: 翻訳のお気に入り
zh_hans: 翻译收藏

# translation.clipboard.action
source: Translate
ja: 翻訳
zh_hans: 翻译

# translation.defaultTargetLanguage.detail
source: The target language used for new manual, selection, and screenshot translations.
ja: 手動入力、選択範囲、スクリーンショット翻訳で使用する翻訳先言語です。
zh_hans: 用于新的手动输入、划词和截图翻译。

# translation.favorite.clearSearch
source: Clear search
ja: 検索を消去
zh_hans: 清除搜索

# translation.favorite.copyFailed
source: Copy failed
ja: コピーできませんでした
zh_hans: 复制失败

# translation.favorite.copyResult
source: Copy result
ja: 結果をコピー
zh_hans: 复制译文

# translation.favorite.copySource
source: Copy source
ja: 原文をコピー
zh_hans: 复制原文

# translation.favorite.copySucceeded
source: Copied
ja: コピーしました
zh_hans: 已复制

# translation.favorite.count
source: %@ favorites
ja: %@ 件
zh_hans: %@ 条收藏

# translation.favorite.delete
source: Delete favorite
ja: お気に入りを削除
zh_hans: 删除收藏

# translation.favorite.deleteConfirmation
source: Delete this translation favorite?
ja: この翻訳のお気に入りを削除しますか？
zh_hans: 删除这条翻译收藏？

# translation.favorite.deleteFailed
source: Could not delete favorite
ja: お気に入りを削除できませんでした
zh_hans: 删除收藏失败

# translation.favorite.detailTitle
source: Translation snapshot
ja: 翻訳スナップショット
zh_hans: 翻译快照

# translation.favorite.empty
source: No favorites yet
ja: お気に入りはまだありません
zh_hans: 暂无翻译收藏

# translation.favorite.emptyDetail
source: Favorite a completed translation session to keep an immutable snapshot here.
ja: 完了した翻訳セッションをお気に入りにすると、変更されないスナップショットとして保存されます。
zh_hans: 收藏已完成的翻译会话后，会在此保存不可变的结果快照。

# translation.favorite.export
source: Export
ja: 書き出す
zh_hans: 导出

# translation.favorite.exportJSON
source: Export JSON
ja: JSONを書き出す
zh_hans: 导出 JSON

# translation.favorite.exportMarkdown
source: Export Markdown
ja: Markdownを書き出す
zh_hans: 导出 Markdown

# translation.favorite.exportFailed
source: Could not export favorites
ja: お気に入りを書き出せませんでした
zh_hans: 导出收藏失败

# translation.favorite.exportSucceeded
source: Export completed
ja: 書き出しました
zh_hans: 导出完成

# translation.favorite.loadFailed
source: Could not load favorite
ja: お気に入りを読み込めませんでした
zh_hans: 无法载入收藏

# translation.favorite.loadMore
source: Load more
ja: さらに読み込む
zh_hans: 加载更多

# translation.favorite.loadMoreFailed
source: Could not load more favorites
ja: お気に入りをさらに読み込めませんでした
zh_hans: 无法加载更多收藏

# translation.favorite.loading
source: Loading favorites…
ja: お気に入りを読み込み中…
zh_hans: 正在载入收藏…

# translation.favorite.noResultPreview
source: No saved translation
ja: 保存された訳文なし
zh_hans: 无已保存译文

# translation.favorite.operationFailedDetail
source: Please try again. If the problem continues, restart Blocks.
ja: もう一度お試しください。問題が続く場合は、Blocks を再起動してください。
zh_hans: 请重试；如果问题持续，请重新启动积木工具。

# translation.favorite.noSearchResults
source: No matching favorites
ja: 一致するお気に入りがありません
zh_hans: 没有匹配的收藏

# translation.favorite.noSearchResultsDetail
source: Try another source text, translation result, or service name.
ja: 別の原文、翻訳結果、サービス名で検索してください。
zh_hans: 请尝试其他原文、译文或服务名称。

# translation.favorite.resultCount
source: %@ results
ja: %@ 件の結果
zh_hans: %@ 个结果

# translation.favorite.rowAccessibility
source: Source: %@. Translation: %@. %@. %@
ja: 原文：%@。訳文：%@。%@。%@
zh_hans: 原文：%@。译文：%@。%@。%@

# translation.favorite.retranslate
source: Translate again
ja: もう一度翻訳
zh_hans: 重新翻译

# translation.favorite.searchPlaceholder
source: Search source or results
ja: 原文または結果を検索
zh_hans: 搜索原文或译文

# translation.favorite.select
source: Select a favorite
ja: お気に入りを選択
zh_hans: 选择一条收藏

# translation.favorite.selectDetail
source: The saved source and all successful service results will appear here.
ja: 保存した原文と、成功したすべてのサービス結果がここに表示されます。
zh_hans: 这里会展示已保存的原文及当时所有成功服务的译文。

# translation.favorite.source
source: Source text
ja: 原文
zh_hans: 原文

# translation.favorite.title
source: Translation Favorites
ja: 翻訳のお気に入り
zh_hans: 翻译收藏

# translation.language.auto
source: Auto
ja: 自動
zh_hans: 自动

# translation.ocr.defaultService
source: Default OCR service
ja: 既定のOCRサービス
zh_hans: 默认 OCR 服务

# translation.ocr.defaultService.detail
source: Used for screenshot translation. If the selected plugin is unavailable, an error is shown; re-enable or approve it, or choose Apple Vision.
ja: スクリーンショット翻訳に使用します。選択したプラグインが利用できない場合はエラーを表示します。再有効化または承認するか、Apple Visionを選択してください。
zh_hans: 用于截图翻译。所选插件不可用时会显示错误；请重新启用、批准，或改选 Apple Vision。

# translation.ocr.title
source: Screenshot OCR
ja: スクリーンショットOCR
zh_hans: 截图 OCR

# translation.ocr.useAppleVision
source: Use Apple Vision
ja: Apple Visionを使用
zh_hans: 改用 Apple Vision

# translation.plugin.approval.approved
source: Approved
ja: 承認済み
zh_hans: 已批准

# translation.plugin.approval.pending
source: Needs review
ja: 確認が必要
zh_hans: 待复核

# translation.plugin.approval.rejected
source: Rejected
ja: 拒否済み
zh_hans: 已拒绝

# translation.plugin.approvalStatus
source: Approval
ja: 承認状態
zh_hans: 批准状态

# translation.plugin.capabilities
source: Capabilities
ja: 機能
zh_hans: 能力

# translation.plugin.capability.actions
source: Actions
ja: アクション
zh_hans: 操作

# translation.plugin.capability.hooks
source: Automation
ja: 自動化
zh_hans: 自动化

# translation.plugin.capability.translation
source: Translation
ja: 翻訳
zh_hans: 翻译

# translation.plugin.capability.ui
source: Interface
ja: インターフェース
zh_hans: 界面

# translation.plugin.confirmTitle
source: Review plugin before installing
ja: インストール前にプラグインを確認
zh_hans: 安装前复核插件

# translation.plugin.connectionTest
source: Test connection
ja: 接続テスト
zh_hans: 连接测试

# translation.plugin.connectionTestFailed
source: Plugin connection test failed
ja: プラグイン接続テストに失敗しました
zh_hans: 插件连接测试失败

# translation.plugin.disabled
source: Plugin disabled
ja: プラグインを無効にしました
zh_hans: 插件已停用

# translation.plugin.domains
source: External domains
ja: 外部ドメイン
zh_hans: 外发域名

# translation.plugin.empty
source: No native plugins installed
ja: ネイティブプラグインは未インストールです
zh_hans: 尚未安装原生插件

# translation.plugin.enabledCount
source: %@ enabled
ja: %@件を有効化
zh_hans: 已启用 %@ 个

# translation.plugin.emptyDetail
source: Install a .blocksplugin package to add translation or OCR services.
ja: .blockspluginパッケージをインストールして翻訳またはOCRサービスを追加できます。
zh_hans: 安装 .blocksplugin 包以添加翻译或 OCR 服务。

# translation.plugin.enabled
source: Plugin enabled
ja: プラグインを有効にしました
zh_hans: 插件已启用

# translation.plugin.error.generic
source: The plugin operation could not be completed. Review the plugin and try again.
ja: プラグイン操作を完了できませんでした。プラグインを確認して再試行してください。
zh_hans: 无法完成插件操作，请检查插件后重试。

# translation.plugin.error.invalidPackage
source: The selected package is not a valid .blocksplugin package.
ja: 選択したパッケージは有効な.blockspluginパッケージではありません。
zh_hans: 所选内容不是有效的 .blocksplugin 插件包。

# translation.plugin.error.missingSecret
source: Configure the required secret “%@” before enabling this plugin.
ja: このプラグインを有効にする前に、必須シークレット「%@」を設定してください。
zh_hans: 启用该插件前，请先配置必需凭据“%@”。

# translation.plugin.error.operationInProgress
source: Wait for the current plugin operation to finish, then try again.
ja: 現在のプラグイン操作が完了してから再試行してください。
zh_hans: 请等待当前插件操作完成后再试。

# translation.plugin.error.reviewAgain
source: The pending plugin package changed or expired. Review it again before installing.
ja: 保留中のプラグインパッケージが変更されたか期限切れです。インストール前に再確認してください。
zh_hans: 待安装插件已变化或失效，请重新复核后安装。

# translation.plugin.error.validationRequired
source: Run a successful connection test for the current configuration before enabling this plugin.
ja: このプラグインを有効にする前に、現在の設定で接続テストを成功させてください。
zh_hans: 启用该插件前，请先使用当前配置完成一次成功的连接测试。

# translation.plugin.error.secretStorage
source: The plugin credential could not be saved securely. Check Keychain access and try again.
ja: プラグインの認証情報を安全に保存できませんでした。キーチェーンへのアクセスを確認してください。
zh_hans: 无法安全保存插件凭据，请检查钥匙串访问后重试。

# translation.plugin.error.storage
source: Blocks could not safely update the installed plugin. The previous version was preserved when possible.
ja: インストール済みプラグインを安全に更新できませんでした。可能な場合は以前のバージョンを保持しています。
zh_hans: 无法安全更新已安装插件；可恢复时已保留原版本。

# translation.plugin.dataPermission.screenshot_image
source: Send the current screenshot image
ja: 現在のスクリーンショット画像を送信
zh_hans: 外发当前截图原图

# translation.plugin.dataPermissions
source: Data access
ja: データアクセス
zh_hans: 数据访问

# translation.plugin.translationInputs
source: Translation input
ja: 翻訳入力
zh_hans: 翻译输入

# translation.plugin.translationInput.text
source: Source text
ja: 原文テキスト
zh_hans: 原文文本

# translation.plugin.translationInput.screenshot_image
source: Current screenshot image
ja: 現在のスクリーンショット画像
zh_hans: 当前截图原图

# translation.plugin.contextFields
source: Context data
ja: コンテキストデータ
zh_hans: 上下文数据

# translation.plugin.contextField.input_source
source: Invocation source
ja: 起動元の種類
zh_hans: 触发入口类型

# translation.plugin.contextField.source_application_bundle_id
source: Source app identifier
ja: 取得元App識別子
zh_hans: 来源 App 标识

# translation.plugin.contextField.ocr_summary
source: OCR line count
ja: OCR行数
zh_hans: OCR 行数

# translation.plugin.hash
source: Package SHA-256
ja: パッケージSHA-256
zh_hans: 包 SHA-256

# translation.plugin.install
source: Install plugin
ja: プラグインをインストール
zh_hans: 安装插件

# translation.plugin.installed
source: Plugin reviewed, installed, and enabled
ja: プラグインを確認し、インストールして有効にしました
zh_hans: 插件已复核、安装并启用

# translation.plugin.installedNeedsConfiguration
source: The plugin is installed and remains disabled. Configure it, run a successful connection test, then enable it.
ja: プラグインはインストールされましたが無効のままです。設定し、接続テストに成功してから有効にしてください。
zh_hans: 插件已安装并保持停用。请完成配置和连接测试，成功后再启用。

# translation.plugin.installedOnly
source: Plugin installed
ja: プラグインをインストールしました
zh_hans: 插件已安装

# translation.plugin.methods
source: HTTP methods
ja: HTTPメソッド
zh_hans: HTTP 方法

# translation.plugin.none
source: None
ja: なし
zh_hans: 无

# translation.plugin.operationFailed
source: Plugin operation failed
ja: プラグイン操作に失敗しました
zh_hans: 插件操作失败

# translation.plugin.operationSucceeded
source: Plugin updated
ja: プラグインを更新しました
zh_hans: 插件已更新

# translation.plugin.permissionReview
source: Review permissions
ja: 権限を確認
zh_hans: 复核权限

# translation.plugin.permissionManifestInvalid
source: Permission manifest unavailable
ja: 権限マニフェストを読み取れません
zh_hans: 无法读取权限清单

# translation.plugin.permissionManifestInvalid.detail
source: Blocks will not infer missing permissions. Reinstall or remove this plugin before using it again.
ja: Blocks は不足している権限を推測しません。このプラグインを再利用する前に、再インストールまたは削除してください。
zh_hans: Blocks 不会推断缺失的权限。请重新安装或移除该插件后再使用。

# translation.plugin.remove
source: Uninstall plugin
ja: プラグインをアンインストール
zh_hans: 卸载插件

# translation.plugin.removeConfirmation
source: Uninstall this plugin?
ja: このプラグインをアンインストールしますか？
zh_hans: 卸载这个插件？

# translation.plugin.removed
source: Plugin uninstalled
ja: プラグインをアンインストールしました
zh_hans: 插件已卸载

# translation.plugin.revalidate
source: Recheck package integrity
ja: パッケージの整合性を再確認
zh_hans: 重新校验包完整性

# translation.plugin.riskDetail
source: Native plugins run JavaScript in an isolated service. Review the package hash, capabilities, domains, and credential declarations before installing.
ja: ネイティブプラグインは隔離サービス内でJavaScriptを実行します。インストール前にハッシュ、機能、ドメイン、資格情報の宣言を確認してください。
zh_hans: 原生插件会在隔离服务中运行 JavaScript。安装前请核对包哈希、能力、外发域名和凭据声明。

# translation.plugin.riskTitle
source: Third-party plugin code
ja: サードパーティ製プラグインコード
zh_hans: 第三方插件代码

# translation.plugin.publisherVerification
source: Publisher verification
ja: 発行元の検証
zh_hans: 发布者验证

# translation.plugin.publisherUnverified
source: Not verified by Blocks
ja: Blocks では未検証
zh_hans: Blocks 未验证

# translation.plugin.runtimeUnavailable
source: Configured plugin unavailable
ja: 設定済みプラグインを利用できません
zh_hans: 已配置插件不可用

# translation.plugin.loading
source: Loading installed plugins…
ja: インストール済みプラグインを読み込み中…
zh_hans: 正在加载已安装插件…

# translation.plugin.runtimeUnavailable.detail
source: %@ could not be loaded for %@. The saved selection is preserved, but this service remains unavailable until you review it or choose another service.
ja: %@を%@用に読み込めませんでした。保存済みの選択は保持されますが、再確認するか別のサービスを選ぶまで利用できません。
zh_hans: 无法加载 %@ 的 %@ 能力。已保留原配置；请重新复核该插件或选择其他服务。

# translation.plugin.rowDetail
source: Version %@ · %@ · %@
ja: バージョン %@ · %@ · %@
zh_hans: 版本 %@ · %@ · %@

# translation.plugin.secrets
source: Credential declarations
ja: 資格情報の宣言
zh_hans: 凭据声明

# translation.plugin.secret.checking
source: Checking credential status
ja: 認証情報の状態を確認中
zh_hans: 正在检查凭据状态

# translation.plugin.secret.configured
source: Stored securely in Keychain
ja: キーチェーンに安全に保存済み
zh_hans: 已安全存储在钥匙串

# translation.plugin.secret.delete
source: Delete credential
ja: 認証情報を削除
zh_hans: 删除凭据

# translation.plugin.secret.deleteConfirmation
source: Delete this plugin credential?
ja: このプラグインの認証情報を削除しますか？
zh_hans: 删除这项插件凭据？

# translation.plugin.secret.deleteConfirmationDetail
source: %@ will no longer be able to use “%@” until you enter it again.
ja: 再入力するまで、%@ は「%@」を使用できなくなります。
zh_hans: 删除后，%@ 将无法使用“%@”，直到你重新录入。

# translation.plugin.secret.deleted
source: Credential deleted
ja: 認証情報を削除しました
zh_hans: 凭据已删除

# translation.plugin.secret.deletedRequiresValidation
source: Credential deleted. The plugin is disabled and must pass another connection test before use.
ja: 認証情報を削除しました。プラグインは無効化され、再利用前に接続テストが必要です。
zh_hans: 凭据已删除；插件已停用，重新使用前需再次通过连接测试。

# translation.plugin.secret.fieldAccessibility
source: %@ credential %@
ja: %@ の認証情報 %@
zh_hans: %@ 的凭据 %@

# translation.plugin.secret.missing
source: Required credential is not configured
ja: 必要な認証情報が未設定です
zh_hans: 尚未配置所需凭据

# translation.plugin.secret.placeholder
source: Enter credential
ja: 認証情報を入力
zh_hans: 输入凭据

# translation.plugin.secret.saved
source: Credential saved
ja: 認証情報を保存しました
zh_hans: 凭据已保存

# translation.plugin.secret.savedRequiresValidation
source: Credential saved to Keychain. The plugin remains disabled until it passes a connection test with this credential.
ja: 認証情報をキーチェーンに保存しました。この認証情報で接続テストに成功するまでプラグインは無効のままです。
zh_hans: 凭据已保存到钥匙串。使用该凭据通过连接测试前，插件保持停用。

# translation.plugin.sessionCredential.riskTitle
source: Full-session credential
ja: 完全なログインセッションの資格情報
zh_hans: 完整登录会话凭据

# translation.plugin.sessionCredential.warning
source: This credential may represent a complete signed-in session. Blocks never reads browser cookies or refreshes it automatically, and sends it only to: %@.
ja: この資格情報は完全なログインセッションを表す可能性があります。Blocks はブラウザ Cookie を読み取らず、自動更新もせず、次の宛先にのみ送信します：%@。
zh_hans: 该凭据可能代表完整登录会话。Blocks 不读取浏览器 Cookie、不自动刷新，只会发送到：%@。

# translation.plugin.source
source: Source package
ja: ソースパッケージ
zh_hans: 来源包

# translation.plugin.signature
source: Signature
ja: 署名
zh_hans: 签名

# translation.plugin.signed
source: Signed
ja: 署名済み
zh_hans: 已签名

# translation.plugin.title
source: Native Plugins
ja: ネイティブプラグイン
zh_hans: 原生插件

# translation.plugin.unsigned
source: Unsigned
ja: 未署名
zh_hans: 未签名

# translation.plugin.validationSucceeded
source: Package integrity verified
ja: パッケージの整合性を確認しました
zh_hans: 包完整性校验通过

# translation.plugin.version
source: Version
ja: バージョン
zh_hans: 版本

# translation.rememberLastTargetLanguage.detail
source: Use the most recently selected target language for the next session.
ja: 次のセッションで直前に選択した翻訳先言語を使用します。
zh_hans: 下次会话优先使用最近一次选择的目标语言。

# translation.service.availability.available
source: Available
ja: 利用可能
zh_hans: 可用

# translation.service.availability.disabled
source: Disabled
ja: 無効
zh_hans: 已停用

# translation.service.availability.requires_configuration
source: Needs configuration
ja: 設定が必要
zh_hans: 需要配置

# translation.service.availability.requires_download
source: Language download required
ja: 言語のダウンロードが必要
zh_hans: 需要下载语言包

# translation.service.availability.unsupported
source: Unsupported on this system
ja: このシステムでは非対応
zh_hans: 当前系统不支持

# translation.community.confirmation.detail
source: Source text is sent to a non-official community web interface. It may be rate-limited, change, or stop working without notice. No credentials or persistent cookies are used.
ja: 原文は非公式のコミュニティWebインターフェイスへ送信されます。予告なく制限、変更、停止される場合があります。認証情報や永続Cookieは使用しません。
zh_hans: 原文会发送到非官方社区网页接口；接口可能限流、变更或失效。Blocks 不会使用凭据或持久 Cookie。

# translation.community.confirmation.enable
source: Enable Source
ja: ソースを有効にする
zh_hans: 确认启用

# translation.community.confirmation.title
source: Enable a community web source?
ja: コミュニティWebソースを有効にしますか？
zh_hans: 启用社区网页翻译源？

# translation.community.connectionTest
source: Test connection
ja: 接続テスト
zh_hans: 测试连接

# translation.community.connectionTestFailed
source: Community source connection failed
ja: コミュニティ翻訳ソースに接続できませんでした
zh_hans: 社区翻译源连接失败

# translation.community.connectionTestSucceeded
source: The community source returned a valid translation.
ja: コミュニティ翻訳ソースから有効な翻訳が返されました。
zh_hans: 社区翻译源已返回有效译文。

# translation.community.connectionTestSucceededTitle
source: Connection succeeded
ja: 接続に成功しました
zh_hans: 连接成功

# translation.community.error.emptyResponse
source: The community source returned no translation.
ja: コミュニティソースから翻訳結果が返されませんでした。
zh_hans: 社区翻译源没有返回译文。

# translation.community.error.httpStatus
source: The community source returned HTTP %lld.
ja: コミュニティソースが HTTP %lld を返しました。
zh_hans: 社区翻译源返回 HTTP %lld。

# translation.community.error.inputTooLarge
source: The text is too long for this community source.
ja: このコミュニティソースには原文が長すぎます。
zh_hans: 原文超过该社区翻译源的长度限制。

# translation.community.error.invalidRequest
source: The community source request did not pass the network safety policy.
ja: コミュニティソースへのリクエストがネットワーク安全ポリシーを満たしていません。
zh_hans: 社区翻译源请求未通过网络安全策略。

# translation.community.error.invalidResponse
source: The community source returned an unsupported response.
ja: コミュニティソースから未対応の応答が返されました。
zh_hans: 社区翻译源返回了无法解析的响应。

# translation.community.error.network
source: The community source could not be reached.
ja: コミュニティソースに接続できませんでした。
zh_hans: 无法连接社区翻译源。

# translation.community.error.responseLanguageMismatch
source: The translation source returned the wrong target language.
ja: 翻訳ソースが指定と異なる言語を返しました。
zh_hans: 翻译源返回了错误的目标语种。

# translation.community.service.detail
source: No API credential required · Non-official · May be rate-limited or stop working
ja: API認証情報不要・非公式・制限または停止の可能性あり
zh_hans: 免 API 配置 · 非官方 · 可能限流或失效

# translation.service.community.deepl.web
source: DeepL Web (Community)
ja: DeepL Web（コミュニティ）
zh_hans: DeepL 网页翻译（社区）

# translation.service.community.google.web
source: Google Web (Community)
ja: Google Web（コミュニティ）
zh_hans: Google 网页翻译（社区）

# translation.service.community.tencent.web
source: Tencent Web (Community)
ja: Tencent Web（コミュニティ）
zh_hans: 腾讯翻译君网页源（社区）

# translation.service.kind.apple_local
source: Apple on-device
ja: Appleオンデバイス
zh_hans: Apple 本地

# translation.service.kind.community_web
source: Community web source
ja: コミュニティWebソース
zh_hans: 社区网页源

# translation.service.kind.official_external
source: Official external service
ja: 公式外部サービス
zh_hans: 官方外部服务

# translation.service.kind.openai_compatible
source: OpenAI-compatible
ja: OpenAI互換
zh_hans: OpenAI 兼容

# translation.service.kind.plugin
source: Plugin
ja: プラグイン
zh_hans: 插件

# translation.services.detail
source: Enable up to four services. Results always stay in the configured order even when services finish at different times.
ja: 最大4サービスを有効にできます。完了順に関係なく、結果は設定した順序のまま表示されます。
zh_hans: 最多启用四个服务；即使完成时间不同，结果也始终按配置顺序展示。

# translation.services.empty
source: No translation services
ja: 翻訳サービスがありません
zh_hans: 没有翻译服务

# translation.services.emptyDetail
source: Configure an external service or install a translation plugin.
ja: 外部サービスを設定するか、翻訳プラグインをインストールしてください。
zh_hans: 请配置外部服务或安装翻译插件。

# translation.services.enabledCount
source: %@ of 4 services enabled
ja: 4件中%@件を有効化
zh_hans: 已启用 %@ / 4 个服务

# translation.services.externalConfiguration
source: OpenAI-compatible source
ja: OpenAI互換ソース
zh_hans: OpenAI 兼容翻译源

# translation.services.externalConfigurationDetail
source: Only OpenAI-compatible endpoints, models, and API credentials are managed on the AI Services page. Add other official sources above.
ja: AIサービスページでは OpenAI互換のエンドポイント、モデル、API認証情報のみを管理します。その他の公式サービスは上で追加してください。
zh_hans: AI 服务页仅管理 OpenAI 兼容端点、模型和 API 凭据；其他官方翻译源请在上方添加。

# translation.services.configureFirst
source: Configure this source first
ja: 先に設定してください
zh_hans: 请先完成配置

# translation.services.maximumReached
source: Disable another service before enabling this one
ja: このサービスを有効にする前に別のサービスを無効にしてください
zh_hans: 如需启用，请先停用其他服务

# translation.services.moveDown
source: Move service down
ja: サービスを下へ移動
zh_hans: 下移服务
